; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=82, remove_proportion=0.101, bases=32, instance_id=25, output=./training, seed=66

(define (problem warehouse-25)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 box80 box81 box82 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 base32 - base
    )
    (:init
        (to-remove box10)
        (to-remove box32)
        (to-remove box33)
        (to-remove box38)
        (to-remove box40)
        (to-remove box56)
        (to-remove box58)
        (to-remove box72)
        (clear box51)
        (on box51 box17)
        (on box17 box54)
        (on-base box54 base1)
        (clear box36)
        (on box36 box16)
        (on box16 box71)
        (on box71 box11)
        (on box11 box69)
        (on-base box69 base2)
        (clear box60)
        (on-base box60 base3)
        (clear box41)
        (on box41 box66)
        (on-base box66 base4)
        (clear box82)
        (on box82 box6)
        (on box6 box31)
        (on box31 box26)
        (on-base box26 base5)
        (clear box33)
        (on-base box33 base6)
        (clear box1)
        (on box1 box78)
        (on box78 box77)
        (on box77 box43)
        (on box43 box75)
        (on box75 box64)
        (on-base box64 base7)
        (clear box68)
        (on box68 box37)
        (on box37 box12)
        (on-base box12 base8)
        (clear box14)
        (on box14 box5)
        (on-base box5 base9)
        (clear box73)
        (on-base box73 base10)
        (clear box8)
        (on box8 box72)
        (on-base box72 base11)
        (clear box74)
        (on box74 box3)
        (on box3 box61)
        (on box61 box50)
        (on-base box50 base12)
        (clear box27)
        (on box27 box24)
        (on-base box24 base13)
        (clear box20)
        (on box20 box18)
        (on box18 box49)
        (on-base box49 base14)
        (clear box81)
        (on-base box81 base15)
        (clear-base base16)
        (clear-base base17)
        (clear box35)
        (on-base box35 base18)
        (clear box55)
        (on box55 box62)
        (on box62 box25)
        (on-base box25 base19)
        (clear box79)
        (on box79 box32)
        (on box32 box53)
        (on box53 box23)
        (on-base box23 base20)
        (clear box57)
        (on box57 box52)
        (on box52 box45)
        (on box45 box28)
        (on box28 box21)
        (on-base box21 base21)
        (clear box59)
        (on box59 box63)
        (on box63 box65)
        (on-base box65 base22)
        (clear box29)
        (on box29 box38)
        (on-base box38 base23)
        (clear box48)
        (on box48 box47)
        (on box47 box67)
        (on box67 box7)
        (on box7 box15)
        (on-base box15 base24)
        (clear box13)
        (on box13 box80)
        (on-base box80 base25)
        (clear box70)
        (on box70 box30)
        (on box30 box34)
        (on box34 box42)
        (on-base box42 base26)
        (clear box40)
        (on box40 box9)
        (on-base box9 base27)
        (clear box44)
        (on box44 box76)
        (on-base box76 base28)
        (clear-base base29)
        (clear box4)
        (on box4 box10)
        (on box10 box19)
        (on box19 box58)
        (on-base box58 base30)
        (clear box39)
        (on box39 box46)
        (on box46 box56)
        (on box56 box22)
        (on-base box22 base31)
        (clear box2)
        (on-base box2 base32)
    )
    (:goal (and 
        (removed box10)
        (removed box32)
        (removed box33)
        (removed box38)
        (removed box40)
        (removed box56)
        (removed box58)
        (removed box72)
    ))
)

; plan
1. (move box29 box38 box1)
   deleted: (clear box1) (on box29 box38)
   added: (on box29 box1) (clear box38)
   goals met: 0 of 8
2. (move box39 box46 box13)
   deleted: (clear box13) (on box39 box46)
   added: (on box39 box13) (clear box46)
   goals met: 0 of 8
3. (move box4 box10 box14)
   deleted: (clear box14) (on box4 box10)
   added: (on box4 box14) (clear box10)
   goals met: 0 of 8
4. (remove box10 box19)
   deleted: (on box10 box19) (clear box10)
   added: (removed box10) (clear box19)
   goals met: 1 of 8
5. (move box19 box58 box2)
   deleted: (clear box2) (on box19 box58)
   added: (on box19 box2) (clear box58)
   goals met: 1 of 8
6. (move box46 box56 box19)
   deleted: (clear box19) (on box46 box56)
   added: (on box46 box19) (clear box56)
   goals met: 1 of 8
7. (move box79 box32 box20)
   deleted: (clear box20) (on box79 box32)
   added: (on box79 box20) (clear box32)
   goals met: 1 of 8
8. (move box8 box72 box27)
   deleted: (clear box27) (on box8 box72)
   added: (on box8 box27) (clear box72)
   goals met: 1 of 8
9. (remove box32 box53)
   deleted: (on box32 box53) (clear box32)
   added: (removed box32) (clear box53)
   goals met: 2 of 8
10. (remove-from-base box33 base6)
   deleted: (on-base box33 base6) (clear box33)
   added: (removed box33) (clear-base base6)
   goals met: 3 of 8
11. (remove-from-base box38 base23)
   deleted: (on-base box38 base23) (clear box38)
   added: (removed box38) (clear-base base23)
   goals met: 4 of 8
12. (remove box40 box9)
   deleted: (on box40 box9) (clear box40)
   added: (removed box40) (clear box9)
   goals met: 5 of 8
13. (remove box56 box22)
   deleted: (on box56 box22) (clear box56)
   added: (removed box56) (clear box22)
   goals met: 6 of 8
14. (remove-from-base box58 base30)
   deleted: (on-base box58 base30) (clear box58)
   added: (removed box58) (clear-base base30)
   goals met: 7 of 8
15. (remove-from-base box72 base11)
   deleted: (on-base box72 base11) (clear box72)
   added: (removed box72) (clear-base base11)
   goals met: 8 of 8
